#+begin_src python :results drawer :exports results 
import dron; return dron.make_parser().prog
#+end_src

#+RESULTS:
:results:
dron -- simple frontend for Systemd, inspired by cron.

- *d* stands for 'Systemd'
- *ron* stands for 'cron'

dron is my attempt to overcome things that make working with Systemd tedious
:end:


#+begin_src python :results drawer :exports results 
import dron; return dron.make_parser().epilog
#+end_src

#+RESULTS:
:results:

* Using
  
#+begin_src python :results value :exports results 
import dron; 
p = dron.make_parser()
p.prog = ''
p.epilog = ''
return p.format_help()
#+end_src

#+RESULTS:
#+begin_example
usage: [-h] {managed,timers,past,edit,apply,lint} ...

positional arguments:
  {managed,timers,past,edit,apply,lint}
    managed             List units managed by dron
    timers              List all timers
    past                List past job runs
    edit                Edit  drontab (like 'crontab -e')
    apply               Apply drontab (like 'crontab' with no args)
    lint                Check drontab (no 'crontab' alternative, sadly!)

optional arguments:
  -h, --help            show this help message and exit
#+end_example


